lfazio/rv32cortex-m/src/platform/stm32f746/main.c
/*
 * The emulator is already suspended whenever these run: they are reached
 * from emu_net_poll(), which the run loop calls between guest slices, so
 * no guest instruction is in flight. Nothing has to be stopped -- but
 * the restart does have to be explicit, because the bus regions and the
 * reset vector were built from the old image.
 */
/*
 * Both halves land in the flash arena, back to back, and the guest is
 * restarted only when the second arrives.
 *
 * The writable half cannot go straight into guest RAM, which is the
 * obvious thing and is wrong: start_guest() clears RAM beyond the image
 * -- deliberately, so that one test cannot pass on state another wrote
 * -- and it is start_guest() that the upload calls. The .data written
 * during the transfer was being zeroed by the reload it triggered.
 * Nothing would have reported it: the check is "did the guest run", and
 * it does, with every initialised variable set to zero. Two of the three
 * guests in the tree have an empty .rw, so the obvious thing to test it
 * with cannot see it either.
 *
 * Keeping both halves in flash also makes the arrangement identical to
 * the baked-in image -- one blob, split at g_img_ro -- so start_guest()
 * needs no case for where the image came from, and a reset re-runs the
 * uploaded guest rather than reverting to the built-in one.
 *
 * Hence the contract: upload `rom`, then `ram`. The ram half is the
 * commit point, because it is the one that completes an image; a guest
 * with no .data uploads an empty one to say so. Committing on the rom
 * half instead would restart the guest with the *previous* image's
 * .data, print a whole run's worth of output from it, and only then be
 * corrected -- and a harness reading the console cannot tell that first
 * summary from the real one.
 */
static uint32_t g_up_addr;      /* where the rom half is being written  */
static bool     g_reload;

bool emu_net_image_begin(void)
{
    g_up_addr = board_flash_arena_begin();
    return g_up_addr != 0u;
}

bool emu_net_image_data(const void *data, uint32_t len, uint32_t off)
{
    return board_flash_write(g_up_addr + off, data, len);
}

void emu_net_image_end(uint32_t len, bool ok)
{
    if (!ok) {
        /*
         * The arena filling up is the *expected* failure, not an
         * exceptional one: TFTP carries no length, so running out is how
         * the end is discovered. Erasing here is what makes the client's
         * retry succeed rather than fail identically for ever.
         */
        (void)board_flash_arena_reset();
        g_up_addr = 0u;
        console_printf("\nemu: upload failed\n");
        return;
    }

    board_flash_arena_commit(len);

    g_img      = (const uint8_t *)g_up_addr;
    g_img_size = len;

    /*
     * Flagged, not acted on. The address space has to be rebuilt around
     * the new image and the core reset, and neither can happen from
     * inside a TFTP callback -- which runs from emu_net_poll(), called
     * between guest slices, with the current guest's regions live.
     */
    g_reload = true;
}

/* ------------------------------------------------------------------ */
/* Images arriving through gdb's `load`                                */
/* ------------------------------------------------------------------ */

/*
 * The same arena the TFTP path uses, driven by vFlashErase /
 * vFlashWrite / vFlashDone instead.
 *
 * Worth having because it collapses the whole upload dance into one
 * command: `load` in gdb puts the image where the read-only half
 * actually lives and leaves the debugger attached and in control, 
 * is exactly the position from  a guest bug is worth looking at.
 *
 * board_flash_write is what makes it safe. Programming stalls fetch from
 * the bank being written, and that routine runs from ITCM together with
 * the HAL flash driver -- the property the TFTP path already depends on,
 * reused rather than rediscovered.
 *
 * gdb addresses these in *guest* space, so the arena offset is applied
 * here; the guest's view is what gdb's ELF says and the arena is an
 * implementation detail of where it lands.
 */
static uint8_t  g_gf_carry[4];
static uint32_t g_gf_carry_len;
static uint32_t g_gf_carry_off;
static uint32_t g_gf_len;   /* highest byte gdb has written */     /* guest offset of g_gf_carry[0] */

static bool gdb_flash_erase(uint32_t addr, uint32_t len)
{
    (void)len;

    /*
     * gdb erases before writing, and it is the first erase that decides
     * where this image starts. Later ones inside the same load are
     * already covered: the arena is handed out erased.
     */
    if (addr < EMU_GUEST_RAM_BASE) {
        return false;
    }
    if (g_up_addr == 0u) {
        g_up_addr = board_flash_arena_begin();
        g_gf_carry_len = 0u;
    }
    return g_up_addr != 0u;
}

/*
 * gdb does not send word-aligned chunks, and board_flash_write requires
 * them.
 *
 * Its contract in board.h is "sequential and word aligned in length
 * except for the last", which the TFTP path satisfies for free -- 512
 * byte blocks. gdb sends whatever fits its packet: ~975 bytes per write
 * here. Each such chunk had its tail padded to a word with 0xFF and the
 * next one then began at a non-aligned flash address, so `load` reported
 * success, the image landed corrupted, and the guest ran away without
 * reaching the first breakpoint. The transfer looks perfect from both
 * ends; only the guest disagrees.
 *
 * So carry the 1-3 byte remainder into the next call and hand the flash
 * only whole words. The carry is flushed when a write arrives that is
 * not contiguous with it -- gdb moves between sections, and the gap
 * between .text.rvtest and .data is exactly that case -- and again at
 * vFlashDone for the final partial word.
 */
static bool gf_flush(void)
{
    bool ok = true;

    if (g_gf_carry_len != 0u) {
        /* board_flash_write pads a short tail with 0xFF, which is the
         * erased state, so a final partial word is safe here. */
        ok = board_flash_write(g_up_addr + g_gf_carry_off,
                               g_gf_carry, g_gf_carry_len);
        g_gf_carry_len = 0u;
    }
    return ok;
}

static bool gdb_flash_write(uint32_t addr, const void *data, uint32_t len)
{
    const uint8_t *const src = (const uint8_t *)data;
    const uint32_t off = addr - EMU_GUEST_RAM_BASE;
    uint32_t pos = 0u;

    if (g_up_addr == 0u || addr < EMU_GUEST_RAM_BASE) {
        return false;
    }

    /* A jump to a new section abandons whatever partial word was held
     * for the old one; it belongs at its own address, not this one. */
    if (g_gf_carry_len != 0u &&
        (g_gf_carry_off + g_gf_carry_len) != off) {
        if (!gf_flush()) {
            return false;
        }
    }

    if (g_gf_carry_len != 0u) {
        while (g_gf_carry_len < 4u && pos < len) {
            g_gf_carry[g_gf_carry_len++] = src[pos++];
        }
        if (g_gf_carry_len < 4u) {
            return true;                /* still short of a word */
        }
        if (!board_flash_write(g_up_addr + g_gf_carry_off, g_gf_carry, 4u)) {
            return false;
        }
        g_gf_carry_len = 0u;
    }

    {
        const uint32_t rest = len - pos;
        const uint32_t whole = rest & ~3u;
        const uint32_t tail = rest - whole;

