lfazio/rv32cortex-m/src/platform/stm32f746/main.c
        if (whole != 0u &&
            !board_flash_write(g_up_addr + off + pos, &src[pos], whole)) {
            return false;
        }
        if (tail != 0u) {
            for (uint32_t i = 0; i < tail; i++) {
                g_gf_carry[i] = src[pos + whole + i];
            }
            g_gf_carry_len = tail;
            g_gf_carry_off = off + pos + whole;
        }
    }

    /* The highest byte seen is the image's length: gdb writes segments
     * in whatever order it likes and never says how much there is. */
    if (off + len > g_gf_len) {
        g_gf_len = off + len;
    }
    return true;
}

static bool gdb_flash_done(void)
{
    if (g_up_addr == 0u || g_gf_len == 0u) {
        return false;
    }
    if (!gf_flush()) {          /* the last partial word */
        return false;
    }
    board_flash_arena_commit(g_gf_len);
    g_img      = (const uint8_t *)g_up_addr;
    g_img_size = g_gf_len;
    g_gf_len   = 0u;
    g_up_addr  = 0u;
    g_reload   = true;
    return true;
}

static const emu_gdb_flash_ops_t k_gdb_flash = {
    gdb_flash_erase, gdb_flash_write, gdb_flash_done,
};

/*
 * Take a freshly uploaded image, if one is waiting. True when the guest
 * was restarted from it.
 *
 * One function because there are two places that must do this and they
 * are easy to let drift: between guest slices, and after a guest has
 * halted. The second is the one that matters for a test harness and was
 * the one missing.
 */
static bool take_uploaded_image(void)
{
    if (!g_reload) {
        return false;
    }
    g_reload = false;

    /*
     * The bus only, at this point: emu_core_open() needs one to open
     * onto, and the devices, reset and boot come later through
     * start_guest() -- which needs the core to exist.
     */
    /*
     * The whole bring-up, not just the bus: a new image needs the
     * frontend's devices re-added, RAM cleared and the core reset, and
     * skipping that leaves the previous guest's core state in place --
     *  presents as the new guest retiring zero instructions.
     */
    if (!start_guest()) {
        console_printf("emu: uploaded image does not fit guest RAM\n");
        return false;
    }

    console_printf("\nemu: running uploaded image, %u bytes\n",
                   (unsigned)g_img_size);
    return true;
}
#endif

/* ------------------------------------------------------------------ */
/* Diagnostics                                                         */
/* ------------------------------------------------------------------ */



/* ------------------------------------------------------------------ */
/* Entry                                                               */
/* ------------------------------------------------------------------ */

int main(void)
{
    board_init();

#if RV32_NATIVE_COREMARK
    /*
     * Native baseline: the same CoreMark sources compiled for Cortex-M7
     * and run directly, with no emulation, so the interpreter and JIT
     * numbers can be put against something absolute.
     */
    {
        extern int coremark_native_main(void);
        console_printf("\n\nrv32cortex-m: NATIVE CoreMark on %s @ %u MHz\n\n",
                       emu_board_core_name,
                       (unsigned)(SystemCoreClock / 1000000u));
        const uint32_t c0 = board_cycles();
        (void)coremark_native_main();
        console_printf("\n-- native --\n  host     %u cycles\n",
                       (unsigned)(board_cycles() - c0));
        for (;;) { __WFI(); }
    }
#endif
    /*
     * The frontend names itself, and builds its ISA string from the
     * extensions actually compiled in, so the banner cannot drift from what
     * the core implements -- which it could when this file spelled the
     * string out itself.
     */
    const emu_cpu_ops_t *const ops = emu_frontend_default();

    console_printf("\n\nrv32cortex-m: %s on %s @ %u MHz\n",
                   ops->desc, emu_board_core_name,
                   (unsigned)(SystemCoreClock / 1000000u));

#if EMU_NET
    /*
     * The handover happens here, before the rest of the banner, so that
     * everything describing what is about to run -- guest size, guest
     * RAM, which backend came up -- reaches a telnet client rather than
     * a serial port nobody is watching. It is buffered until one
     * connects, which is what net_telnet.c's output ring is for.
     *
     * The two lines below are the last thing the UART ever carries as
     * text, and they are deliberately the two that matter when nothing
     * works: whether the stack started at all, and what address to
     * connect to. After this, silence on the serial port is expected and
     * silence on the network is the fault.
     */
    console_printf("net    %s on this port; telnet %s 23\n",
                   EMU_NET_LINK_PPP ? "PPP" : "SLIP", emu_net_addr_str());
    if (!emu_net_init()) {
        console_printf("net    failed to start; staying on the serial console\n");
    }
#endif

    /*
     * Which image is running, before anything asks. build_address_space()
     * reads these rather than the .incbin symbols -- that is what lets an
     * upload replace the image at run time -- so leaving them until after
     * the bus is built publishes a zero-length ROM region, which the bus
     * rejects, and the firmware halts before it has run an instruction.
     */
    g_img_size = emu_guest_image_size;

    /*
     * The bus only here: emu_core_open() needs one to open onto, and the
     * devices, reset and boot come later through start_guest(), 
     * needs the core to exist.
     */
    publish_image();
    if (!emu_build_address_space(&g_bus, &g_uart)) {
        console_printf("fatal: could not build the guest address space\n");
        fatal_halt();
    }

    if (!emu_core_open(&g_core, ops, &g_bus, 0u)) {
        console_printf("fatal: frontend has no core 0\n");
        fatal_halt();
    }

    ops->set_unmask_hook(g_core.cpu, emu_board_irq_unmask, NULL);
    emu_board_irqs_init();
    emu_uart_init(&g_uart, emu_console_uart_tx, guest_uart_rx, NULL);
    ops->set_syscall(g_core.cpu, emu_guest_syscall, &g_sc_ctx);
    ops->set_cache(g_core.cpu, &emu_arm_cache_ops);

